far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
    // Enable SPI1
    SPI1->CR1 |= SPI_CR1_SPE;
}

uint8_t crc8(uint8_t *data, size_t len)
{
    uint8_t crc = 0x00;
    while (len--)
    {
        crc ^= *data++;
        for (uint8_t i = 0; i < 8; ++i)
        {
            if (crc & 0x80)
                crc = (crc << 1) ^ 0x07; // Polynomial 0x07
            else
                crc <<= 1;
        }
    }
    return crc;
}

void EnterConfigUpdateMode(void)
{
    uint8_t command[] = { 0x00, 0x90 };
    uint8_t crc = crc8(command, 2);
    uint8_t txData[] = { command[0], command[1], crc };

    // Pull NSS low
    GPIOB->ODR &= ~GPIO_ODR_OD0;

    // Transmit data
    SPI1_Transmit(txData, sizeof(txData));

    // Pull NSS high
    GPIOB->ODR |= GPIO_ODR_OD0;
}

void SPI1_Transmit(uint8_t *data, size_t len)
{
    for (size_t i = 0; i < len; ++i)
    {
        // Wait until TXE (Transmit buffer empty) flag is set
        while (!(SPI1->SR & SPI_SR_TXE));
        // Send data
        SPI1->DR = data[i];
        // Wait until RXNE (Receive buffer not empty) flag is set
//        while (!(SPI1->SR & SPI_SR_RXNE));
        // Read data to clear RXNE flag
//        (void)SPI1->DR;
    }

    // Wait until not busy
    while (SPI1->SR & SPI_SR_BSY);

    // Clear overrun flag by reading DR and SR
    (void)SPI1->DR;
    (void)SPI1->SR;
}
**/

#include "stm32l4xx_hal.h"
#include <stdbool.h>

// Function prototypes
void SystemClock_Config(void);
void GPIO_Init(void);
void SPI1_Init(void);
uint8_t crc8(uint8_t *data, size_t len);

// Functions to handle communication with the AFE
void DirectCmdRead(uint8_t cmd, uint8_t *returnData, uint8_t len);
void SubCmdNoData(uint16_t cmd);
void SubCmdReadData(uint16_t cmd, uint8_t *returnData, uint8_t len);
void RAMRegisterRead(uint16_t addr, uint8_t *returnData, uint8_t len);
void RAMRegisterWrite(uint16_t addr, uint8_t *writeData, uint8_t len);

// Helper functions that do the handling for verifying the AFE received a SPI command
void AFETransmitReadCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize);
void AFETransmitWriteCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize);

void SPI1_Receive(uint8_t *data, size_t len);
void SPI1_Transmit(uint8_t *data, size_t len);

// Global defines 
// TODO: Move these into a header file for the BQ7695204
// Calibration gains
#define CAL_GAIN_CL1 0x9180
#define CAL_GAIN_CL2 0x9182
#define CAL_GAIN_CL3 0x9184
#define CAL_GAIN_CL4 0x9186
#define CAL_GAIN_CL5 0x9188
#define CAL_GAIN_CL6 0x918A
#define CAL_GAIN_CL7 0x918C
#define CAL_GAIN_CL8 0x918E
#define CAL_GAIN_CL9 0x9190
#define CAL_GAIN_CL10 0x9192
#define CAL_GAIN_CL11 0x9194
#define CAL_GAIN_CL12 0x9196
#define CAL_GAIN_CL13 0x9198
#define CAL_GAIN_CL14 0x919A
#define CAL_GAIN_CL15 0x919C
#define CAL_GAIN_CL16 0x919E
#define CAL_GAIN_PACK 0x91A0
#define CAL_GAIN_TOS 0x91A2
#define CAL_GAIN_LD 0x91A4
#define CAL_GAIN_ADC 0x91A6
#define CAL_GAIN_CC 0x91A8
#define CAL_GAIN_CAP 0x91AC

// Calibration temperature offsets
#define CAL_OFST_VCELL 0x91B0
#define CAL_OFST_VDIV 0x91B2
#define CAL_OFST_CLMB_CTR 0x91C6
#define CAL_OFST_BRD 0x91C6
#define CAL_OFST_INT_TMP 0x91CA
#define CAL_OFST_CFETOFF_TEMP 0x91CB
#define CAL_OFST_DFETOFF_TEMP 0x91CC
#define CAL_OFST_ALERT_TEMP 0x91CD
#define CAL_OFST_TS1_TEMP 0x91CE
#define CAL_OFST_TS2_TEMP 0x91CF
#define CAL_OFST_TS3_TEMP 0x91D0
#define CAL_OFST_HDQ_TEMP 0x91D1
#define CAL_OFST_DCHG_TEMP 0x91D2
#define CAL_OFST_DDSG_TEMP 0x91D3

// Calibration internal temperature model
#define CAL_INTTEMP_GAIN 0x91E2
#define CAL_INTTEMP_BASE 0x91E4
#define CAL_INTTEMP_MAX_AD 0x91E6
#define CAL_INTTEMP_MAX_TEMP 0x91E8

// Calibration 18K temperature model
#define CAL_18KTEMP_CF_A1 0x91EA
#define CAL_18KTEMP_CF_A2 0x91EC
#define CAL_18KTEMP_CF_A3 0x91EE
#define CAL_18KTEMP_CF_A4 0x91F0
#define CAL_18KTEMP_CF_A5 0x91F2
#define CAL_18KTEMP_CF_B1 0x91F4
#define CAL_18KTEMP_CF_B2 0x91F6
#define CAL_18KTEMP_CF_B3 0x91F8
#define CAL_18KTEMP_CF_B4 0x91FA
#define CAL_18KTEMP_ADC0 0x91FE

// Calibration 180K temperature model
#define CAL_180KTEMP_CF_A1 0x9200
#define CAL_180KTEMP_CF_A2 0x9202
#define CAL_180KTEMP_CF_A3 0x9204
#define CAL_180KTEMP_CF_A4 0x9206
#define CAL_180KTEMP_CF_A5 0x9208
#define CAL_180KTEMP_CF_B1 0x920A
#define CAL_180KTEMP_CF_B2 0x920C
#define CAL_180KTEMP_CF_B3 0x920E
#define CAL_180KTEMP_CF_B4 0x9210
#define CAL_180KTEMP_ADC0 0x9214

// Calibration custom temperature model
#define CAL_CSTMTEMP_CF_A1 0x9216
#define CAL_CSTMTEMP_CF_A2 0x9218
#define CAL_CSTMTEMP_CF_A3 0x921A
#define CAL_CSTMTEMP_CF_A4 0x921C
#define CAL_CSTMTEMP_CF_A5 0x921E
#define CAL_CSTMTEMP_CF_B1 0x9220
#define CAL_CSTMTEMP_CF_B2 0x9222
#define CAL_CSTMTEMP_CF_B3 0x9224
#define CAL_CSTMTEMP_CF_B4 0x9226
#define CAL_CSTMTEMP_RC0 0x9228
#define CAL_CSTMTEMP_ADC0 0x922A

// Global SPI handle
SPI_HandleTypeDef hspi1;

// Global constants
// Register addresses for writing command/RAM addresses in transactions
// TODO: Move these into a header file for the BQ7695204
const uint8_t LOWER_ADDR_REG_READ = 0x3E;
const uint8_t UPPER_ADDR_REG_READ = 0x3F;
const uint8_t LOWER_ADDR_REG_WRITE = 0xBE;
const uint8_t UPPER_ADDR_REG_WRITE = 0xBF;

// Starting address for 32-byte data buffer
const uint8_t READ_DATA_BUFF_LSB = 0x40;
const uint8_t WRITE_DATA_BUFF_LSB = 0xC0;

// Register addresses for writing checksum and data length info for transactions
const uint8_t READ_CHECKSUM_ADDR = 0x60;
const uint8_t READ_DATALEN_ADDR = 0x61;
const uint8_t WRITE_CHECKSUM_ADDR = 0xE0;
const uint8_t WRITE_DATALEN_ADDR = 0xE1;

int main(void)
{
    // HAL initialization
    HAL_Init();

    // System clock configuration
    SystemClock_Config();

    // Initialize GPIO and SPI
    GPIO_Init();
    SPI1_Init();

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_RESET); // Turn off heartbeat

    // Blank array to store data from any commands that receive data
    uint8_t readData[32] = {0};

    uint16_t cellVolt = 0;
    uint16_t cellVolts[17] = {0};
    uint8_t cmdAddr = 0;
    // Send FET_ENABLE sub-command to allow test commands to toggle FETs
//	SubCmdNoData(0x0022);

    while (1)
    {
    	SubCmdNoData(0x0022); // Send FET_ENABLE sub-command
    	SubCmdReadData(0x0057, readData, 2); // Read manufacturing data
    	// Read the cell voltage for all 16 cells and then the pack voltage
//    	for (int i = 0; i < 17; i++) {
//    		cmdAddr = 0x14 + 2*i;
//    		DirectCmdRead(cmdAddr, readData, 2);
//    		// Combine the 2 8-bit cell voltage bytes into a single 16-byte variable
//    		cellVolt = (readData[0]) + (readData[1] << 8);
//    		cellVolts[i] = cellVolt;
//    	}
    	HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_5); // Toggle heartbeat LED
    	HAL_Delay(2000);
    }
}

void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    // Configure the main internal regulator output voltage
    HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

    // Initializes the RCC Oscillators according to the specified parameters
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
    RCC_OscInitStruct.MSIState = RCC_MSI_ON;
    RCC_OscInitStruct.MSICalibrationValue = RCC_MSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

