far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
	// Continue to upper byte
	txData[0] = commandUpperAddr[0];
	txData[1] = commandUpperAddr[1];
	txData[2] = crcUpper;
//	commReceived = false;
//	while (!commReceived)
//	{
//		// Pull NSS low
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
//
//		// Transmit data and receive AFE's response
//		HAL_SPI_TransmitReceive(&hspi1, txData, rxData, sizeof(txData), HAL_MAX_DELAY);
//
//		// Confirm command was received
//		commReceived = true;
//		for (int i = 0; i < sizeof(txData); i++)
//		{
//			if (txData[i] != rxData[i]) commReceived = false; // If any mismatch occurs, flag it and retransmit
//		}
//		// Pull NSS high and wait for transaction to be processed
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
//		HAL_Delay(3);
//	}
	AFETransmitWriteCmd(txData, rxData, sizeof(txData));

	// Read each byte based on the data length given in parameters
	uint8_t readData[2] = {0};
	for (int i = 0; i < len; i++) {
		readData[0] = READ_DATA_BUFF_LSB + i;
		readData[1] = 0xFF;

		txData[0] = readData[0];
		txData[1] = readData[1];
		txData[2] = crc8(readData, 2);

//		commReceived = false;
//		while (!commReceived)
//		{
//			// Pull NSS low
//			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
//
//			// Transmit data and receive AFE's response
//			HAL_SPI_TransmitReceive(&hspi1, txData, rxData, sizeof(txData), HAL_MAX_DELAY);
//
//			// Confirm command was received by checking address byte received
//			if (txData[0] == rxData[0]) commReceived = true;
//			// Pull NSS high and wait for transaction to be processed
//			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
//			HAL_Delay(3);
//		}
		AFETransmitReadCmd(txData, rxData, sizeof(txData));

		returnData[i] = rxData[1]; // Save data byte received from last transaction
	}
}

/**
 * Writes the given value in one of the AFE's RAM registers
 * Might remove this function, it's exactly the same as the SubCmd read data function
 * @param addr The register address
 * @param writeData Pointer to the 8-bit integer array for the data to write to the register
 * @param len Number of bytes to write to the AFE's 32-byte data buffer
 */
void RAMRegisterWrite(uint16_t addr, uint8_t *writeData, uint8_t len)
{
	uint8_t rxData[3] = {0};
	uint8_t lowerAddr[] = { LOWER_ADDR_REG_WRITE, ((uint8_t)(addr & 0xFF)) };
	uint8_t crcLower = crc8(lowerAddr, 2);
	uint8_t upperAddr[] = { UPPER_ADDR_REG_WRITE, ((uint8_t)(addr >> 8)) };
	uint8_t crcUpper = crc8(upperAddr, 2);
//	bool commReceived = false;

	// Keep writing the register address until MISO reflects command was received
	// Starting with lower byte
	uint8_t txData[] = { lowerAddr[0], lowerAddr[1], crcLower };
//	while (!commReceived)
//	{
//		// Pull NSS low
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
//		// Transmit data and receive AFE's response
//		HAL_SPI_TransmitReceive(&hspi1, txData, rxData, sizeof(txData), HAL_MAX_DELAY);
//
//		// Confirm address byte was received
//		commReceived = true;
//		for (int i = 0; i < sizeof(txData); i++)
//		{
//			if (txData[i] != rxData[i]) commReceived = false; // If any mismatch occurs, flag it and retransmit
//		}
//		// Pull NSS high and wait for transaction to be processed
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
//		HAL_Delay(1);
//	}
	AFETransmitWriteCmd(txData, rxData, sizeof(txData));

	// Continue to upper byte
	txData[0] = upperAddr[0];
	txData[1] = upperAddr[1];
	txData[2] = crcUpper;
//	commReceived = false;
//	while (!commReceived)
//	{
//		// Pull NSS low
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
//
//		// Transmit data and receive AFE's response
//		HAL_SPI_TransmitReceive(&hspi1, txData, rxData, sizeof(txData), HAL_MAX_DELAY);
//
//		// Confirm address byte was received
//		commReceived = true;
//		for (int i = 0; i < sizeof(txData); i++)
//		{
//			if (txData[i] != rxData[i]) commReceived = false; // If any mismatch occurs, flag it and retransmit
//		}
//		// Pull NSS high and wait for transaction to be processed
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
//		HAL_Delay(1);
//	}
	AFETransmitWriteCmd(txData, rxData, sizeof(txData));

	// Write the data provided to the AFE's 32-byte data buffer
	uint8_t writeBytes[2] = {0};
	for (int i = 0; i < len; i++)
	{
		// Increment data buffer address and include the next address byte
		writeBytes[0] = WRITE_DATA_BUFF_LSB + i;
		writeBytes[1] = writeData[i];

		txData[0] = writeBytes[0];
		txData[1] = writeBytes[1];
		txData[2] = crc8(writeBytes, 2); // Recalculate CRC

//		commReceived = false;
//		while (!commReceived)
//		{
//			// Pull NSS low
//			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
//			// Transmit data and receive AFE's response
//			HAL_SPI_TransmitReceive(&hspi1, txData, rxData, sizeof(txData), HAL_MAX_DELAY);
//
//			// Confirm write data was received
//			commReceived = true;
//			for (int i = 0; i < sizeof(txData); i++)
//			{
//				if (txData[i] != rxData[i]) commReceived = false; // If any mismatch occurs, flag it and retransmit
//			}
//
//			// Pull NSS high and wait for transaction to be processed
//			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
//			HAL_Delay(1);
//		}
		AFETransmitWriteCmd(txData, rxData, sizeof(txData));
	}

	// Calculate the check-sum and write it to the AFE's checksum register
	uint8_t checkSum = 0;
	for (int i = 0; i < len; i++) {
		checkSum += writeData[i];
	}
	checkSum += lowerAddr[1];
	checkSum += upperAddr[1];

	writeBytes[0] = WRITE_CHECKSUM_ADDR;
	writeBytes[1] = checkSum;

	txData[0] = writeBytes[0];
	txData[1] = writeBytes[1];
	txData[2] = crc8(writeBytes, 2); // Recalculate CRC

	AFETransmitWriteCmd(txData, rxData, sizeof(txData));
//	commReceived = false;
//	while (!commReceived)
//	{
//		// Pull NSS low
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
//		// Transmit data and receive AFE's response
//		HAL_SPI_TransmitReceive(&hspi1, txData, rxData, sizeof(txData), HAL_MAX_DELAY);
//
//		// Confirm write data was received
//		commReceived = true;
//		for (int i = 0; i < sizeof(txData); i++)
//		{
//			if (txData[i] != rxData[i]) commReceived = false; // If any mismatch occurs, flag it and retransmit
//		}
//
//		// Pull NSS high and wait for transaction to be processed
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
//		HAL_Delay(1);
//	}

	// Write the data length to the AFE's data length register
	writeBytes[0] = WRITE_DATALEN_ADDR;
	writeBytes[1] = len + 4; // Length of data buffer, plus upper and lower address bytes, plus checksum and data length bytes

	txData[0] = writeBytes[0];
	txData[1] = writeBytes[1];
	txData[2] = crc8(writeBytes, 2); // Recalculate CRC

	AFETransmitWriteCmd(txData, rxData, sizeof(txData));
//	commReceived = false;
//	while (!commReceived)
//	{
//		// Pull NSS low
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
//		// Transmit data and receive AFE's response
//		HAL_SPI_TransmitReceive(&hspi1, txData, rxData, sizeof(txData), HAL_MAX_DELAY);
//
//		// Confirm write data was received
//		commReceived = true;
//		for (int i = 0; i < sizeof(txData); i++)
//		{
//			if (txData[i] != rxData[i]) commReceived = false; // If any mismatch occurs, flag it and retransmit
//		}
//
//		// Pull NSS high and wait for transaction to be processed
//		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
//		HAL_Delay(1);
//	}
}

void AFETransmitReadCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize)
{
	// Continuously transmit the SPI transaction until the AFE has received it
	bool commReceived = false;
	while (!commReceived)
	{
		// Pull NSS low
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
		// Transmit data and receive AFE's response
		HAL_SPI_TransmitReceive(&hspi1, txBytes, rxBytes, arrSize, HAL_MAX_DELAY);

